_protected/common/components/viewslide.php

SELECT * FROM `sliderimages` WHERE `slider_id`=1
---
    public function run(){
        $model = SliderImages::findall(['slider_id'=>2]);